In [2]:
import pandas as pd
import numpy as np

In [3]:
mpg = pd.read_csv('mpg.csv')
mpg.head()

  manufacturer model  displ  year  cyl       trans drv  cty  hwy fl category
0         audi    a4    1.8  1999    4    auto(l5)   f   18   29  p  compact
1         audi    a4    1.8  1999    4  manual(m5)   f   21   29  p  compact
2         audi    a4    2.0  2008    4  manual(m6)   f   20   31  p  compact
3         audi    a4    2.0  2008    4    auto(av)   f   21   30  p  compact
4         audi    a4    2.8  1999    6    auto(l5)   f   16   26  p  compact

In [4]:
# Q1
displ_under4 = mpg.query('displ <= 4')
displ_over5 = mpg.query('displ >= 5')

In [5]:
displ_under4['hwy'].mean()

25.96319018404908

In [6]:
displ_over5['hwy'].mean()

18.07894736842105

In [7]:
# Q2
audi = mpg.query('manufacturer == "audi"')
toyota = mpg.query('manufacturer == "toyota"')

In [8]:
audi['cty'].mean()

17.61111111111111

In [9]:
toyota['cty'].mean()

18.529411764705884

In [10]:
# Q3
manu3 = mpg.query('manufacturer in ["chevrolet", "ford", "honda"]')

In [11]:
manu3['hwy'].mean()

22.50943396226415

In [12]:
# Q4
new_mpg = mpg[['category', 'cty']]
new_mpg.head()

  category  cty
0  compact   18
1  compact   21
2  compact   20
3  compact   21
4  compact   16

In [13]:
# Q5
new_mpg.query('category == "suv"')['cty'].mean()

13.5

In [14]:
new_mpg.query('category == "compact"')['cty'].mean()

20.127659574468087

In [15]:
# Q6
audi.sort_values('hwy', ascending = False).head()

,manufacturer,model,displ,year,cyl,trans,drv,cty,hwy,fl,category
2,audi,a4,2.0,2008,4,manual(m6),f,20,31,p,compact
3,audi,a4,2.0,2008,4,auto(av),f,21,30,p,compact
0,audi,a4,1.8,1999,4,auto(l5),f,18,29,p,compact
1,audi,a4,1.8,1999,4,manual(m5),f,21,29,p,compact
9,audi,a4 quattro,2.0,2008,4,manual(m6),4,20,28,p,compact

In [17]:
# Q7
mpg_copy = mpg.assign(total = mpg['cty'] + mpg['hwy']).copy()
mpg_copy.head()

,manufacturer,model,displ,year,cyl,trans,drv,cty,hwy,fl,category,total
0,audi,a4,1.8,1999,4,auto(l5),f,18,29,p,compact,47
1,audi,a4,1.8,1999,4,manual(m5),f,21,29,p,compact,50
2,audi,a4,2.0,2008,4,manual(m6),f,20,31,p,compact,51
3,audi,a4,2.0,2008,4,auto(av),f,21,30,p,compact,51
4,audi,a4,2.8,1999,6,auto(l5),f,16,26,p,compact,42

In [23]:
# Q8
mpg_copy = mpg_copy.assign(mean = mpg_copy['total'] / 2)

In [24]:
# Q9
mpg_copy.sort_values('mean', ascending = False).head(3)

,manufacturer,model,displ,year,cyl,trans,drv,cty,hwy,fl,category,total,mean
221,volkswagen,new beetle,1.9,1999,4,manual(m5),f,35,44,d,subcompact,79,39.5
212,volkswagen,jetta,1.9,1999,4,manual(m5),f,33,44,d,compact,77,38.5
222,volkswagen,new beetle,1.9,1999,4,auto(l4),f,29,41,d,subcompact,70,35.0

In [26]:
# Q10
mpg.assign(total = lambda x: x['cty'] + x['hwy'], \
          mean = lambda x: x['total'] / 2) \
.sort_values('mean', ascending = False).head(3)

,manufacturer,model,displ,year,cyl,trans,drv,cty,hwy,fl,category,total,mean
221,volkswagen,new beetle,1.9,1999,4,manual(m5),f,35,44,d,subcompact,79,39.5
212,volkswagen,jetta,1.9,1999,4,manual(m5),f,33,44,d,compact,77,38.5
222,volkswagen,new beetle,1.9,1999,4,auto(l4),f,29,41,d,subcompact,70,35.0

In [28]:
# Q11
mpg.groupby('category') \
    .agg(cty_mean = ('cty', 'mean'))

             cty_mean
category
2seater     15.400000
compact     20.127660
midsize     18.756098
minivan     15.818182
pickup      13.000000
subcompact  20.371429
suv         13.500000

In [29]:
# Q12
mpg.groupby('category') \
    .agg(cty_mean = ('cty', 'mean')) \
    .sort_values('cty_mean', ascending = False)

             cty_mean
category
subcompact  20.371429
compact     20.127660
midsize     18.756098
minivan     15.818182
2seater     15.400000
suv         13.500000
pickup      13.000000

In [31]:
# Q13
mpg.groupby('manufacturer') \
    .agg(hwy_mean = ('hwy', 'mean')) \
    .sort_values('hwy_mean', ascending = False) \
    .head(3)

               hwy_mean
manufacturer
honda         32.555556
volkswagen    29.222222
hyundai       26.857143

In [32]:
# Q14
mpg.query('category == "compact"') \
    .groupby('manufacturer') \
    .agg(count = ('category', 'count')) \
    .sort_values('count', ascending = False)

              count
manufacturer
audi             15
volkswagen       14
toyota           12
subaru            4
nissan            2

In [45]:
# Q15
fuel = pd.DataFrame({'fl' : ['c', 'd', 'e', 'p', 'r'],
                    'price_fl' : [2.35, 2.38, 2.11, 2.76, 2.22]})
fuel

  fl  price_fl
0  c      2.35
1  d      2.38
2  e      2.11
3  p      2.76
4  r      2.22

In [46]:
mpg = pd.merge(mpg, fuel, how = 'left', on = 'fl')
mpg.head()

,manufacturer,model,displ,year,cyl,trans,drv,cty,hwy,fl,category,price_f1,price_fl
0,audi,a4,1.8,1999,4,auto(l5),f,18,29,p,compact,2.76,2.76
1,audi,a4,1.8,1999,4,manual(m5),f,21,29,p,compact,2.76,2.76
2,audi,a4,2.0,2008,4,manual(m6),f,20,31,p,compact,2.76,2.76
3,audi,a4,2.0,2008,4,auto(av),f,21,30,p,compact,2.76,2.76
4,audi,a4,2.8,1999,6,auto(l5),f,16,26,p,compact,2.76,2.76

In [47]:
# Q16
mpg[['model', 'fl', 'price_fl']].head()

  model fl  price_fl
0    a4  p      2.76
1    a4  p      2.76
2    a4  p      2.76
3    a4  p      2.76
4    a4  p      2.76

## Analysis Challenge

In [48]:
# Q1
import pandas as pd
import numpy as np

mw = pd.read_csv('midwest.csv')

In [49]:
mw.head()

,PID,county,state,area,poptotal,popdensity,popwhite,popblack,popamerindian,popasian,...,percollege,percprof,poppovertyknown,percpovertyknown,percbelowpoverty,percchildbelowpovert,percadultpoverty,percelderlypoverty,inmetro,category
0,561,ADAMS,IL,0.052,66090,1270.961540,63917,1702,98,249,...,19.631392,4.355859,63628,96.274777,13.151443,18.011717,11.009776,12.443812,0,AAR
1,562,ALEXANDER,IL,0.014,10626,759.000000,7054,3496,19,48,...,11.243308,2.870315,10529,99.087145,32.244278,45.826514,27.385647,25.228976,0,LHR
2,563,BOND,IL,0.022,14991,681.409091,14477,429,35,16,...,17.033819,4.488572,14235,94.956974,12.068844,14.036061,10.852090,12.697410,0,AAR
3,564,BOONE,IL,0.017,30806,1812.117650,29344,127,46,150,...,17.278954,4.197800,30337,98.477569,7.209019,11.179536,5.536013,6.217047,1,ALU
4,565,BROWN,IL,0.018,5836,324.222222,5264,547,14,5,...,14.475999,3.367680,4815,82.505140,13.520249,13.022889,11.143211,19.200000,0,AAR

In [50]:
mw = mw.assign(percchild = 100 - (mw['popadults'] / mw['poptotal'] * 100))
mw.head()

,PID,county,state,area,poptotal,popdensity,popwhite,popblack,popamerindian,popasian,...,percprof,poppovertyknown,percpovertyknown,percbelowpoverty,percchildbelowpovert,percadultpoverty,percelderlypoverty,inmetro,category,percchild
0,561,ADAMS,IL,0.052,66090,1270.961540,63917,1702,98,249,...,4.355859,63628,96.274777,13.151443,18.011717,11.009776,12.443812,0,AAR,34.486307
1,562,ALEXANDER,IL,0.014,10626,759.000000,7054,3496,19,48,...,2.870315,10529,99.087145,32.244278,45.826514,27.385647,25.228976,0,LHR,36.721250
2,563,BOND,IL,0.022,14991,681.409091,14477,429,35,16,...,4.488572,14235,94.956974,12.068844,14.036061,10.852090,12.697410,0,AAR,35.501301
3,564,BOONE,IL,0.017,30806,1812.117650,29344,127,46,150,...,4.197800,30337,98.477569,7.209019,11.179536,5.536013,6.217047,1,ALU,37.440758
4,565,BROWN,IL,0.018,5836,324.222222,5264,547,14,5,...,3.367680,4815,82.505140,13.520249,13.022889,11.143211,19.200000,0,AAR,31.819740

In [54]:
# Q2
mw[['county', 'percchild']].sort_values('percchild', ascending = False).head()

        county  percchild
230   ISABELLA  51.501172
404  MENOMINEE  50.591260
281     ATHENS  49.320727
247    MECOSTA  49.059183
154     MONROE  47.358182

In [56]:
# Q3
mw = mw.assign(child_level = np.where(mw['percchild'] >= 40, 'large', 
                                np.where(mw['percchild'] >= 30, 'middle', 'small')))
mw.head()

,PID,county,state,area,poptotal,popdensity,popwhite,popblack,popamerindian,popasian,...,poppovertyknown,percpovertyknown,percbelowpoverty,percchildbelowpovert,percadultpoverty,percelderlypoverty,inmetro,category,percchild,child_level
0,561,ADAMS,IL,0.052,66090,1270.961540,63917,1702,98,249,...,63628,96.274777,13.151443,18.011717,11.009776,12.443812,0,AAR,34.486307,middle
1,562,ALEXANDER,IL,0.014,10626,759.000000,7054,3496,19,48,...,10529,99.087145,32.244278,45.826514,27.385647,25.228976,0,LHR,36.721250,middle
2,563,BOND,IL,0.022,14991,681.409091,14477,429,35,16,...,14235,94.956974,12.068844,14.036061,10.852090,12.697410,0,AAR,35.501301,middle
3,564,BOONE,IL,0.017,30806,1812.117650,29344,127,46,150,...,30337,98.477569,7.209019,11.179536,5.536013,6.217047,1,ALU,37.440758,middle
4,565,BROWN,IL,0.018,5836,324.222222,5264,547,14,5,...,4815,82.505140,13.520249,13.022889,11.143211,19.200000,0,AAR,31.819740,middle

In [57]:
mw.groupby('child_level') \
    .agg(n = ('county', 'count'))

               n
child_level
large         32
middle       396
small          9

In [58]:
# Q4
mw.assign(percasian = mw['popasian'] / mw['poptotal'] * 100) \
    .sort_values('percasian') \
    [['state', 'county', 'percasian']] \
    .head(10)

    state     county  percasian
404    WI  MENOMINEE   0.000000
105    IN     BENTON   0.010592
109    IN    CARROLL   0.015950
358    OH     VINTON   0.027032
390    WI       IRON   0.032504
85     IL      SCOTT   0.053154
112    IN       CLAY   0.060716
261    MI     OSCODA   0.063759
340    OH      PERRY   0.066546
73     IL      PIATT   0.070749